Tekla Open API Reference for Tekla Structures 2025
ReinforcementCatalog Class
 The ReinforcementCatalog class represents a group of controls to select rebars using the rebar catalogs.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.ReinforcementCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ReinforcementCatalog : UserControl
Public Class ReinforcementCatalog
	Inherits UserControl
The ReinforcementCatalog type exposes the following members.
Constructors
Name | Description
ReinforcementCatalog()
 Initiates a new instance of the control.
ReinforcementCatalog(String, String, Double)
 Creates a new instance of the ReinforcementCatalog and will select in the tree the rebar that contains the given parameters (if possible).
Top
Properties
Name | Description
ButtonText
 Gets and sets the text of the button control.
SelectedRebarBendingRadius
 Gets the selected rebar bending radius in the control.
SelectedRebarGrade
 Gets the selected rebar grade in the control.
SelectedRebarSize
 Gets the selected rebar size in the control.
Top
Methods
Name | Description
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace